//TaskI Планировщик задач (30 баллов)

/*
 Представьте, вы собрали собственный сервер из n  разнородных процессоров и теперь решили создать для него простейший планировщик задач.

Ваш сервер состоит из n процессоров. Но так как процессоры разные, то и достигают они одинаковой скорости работы при разном энергопотреблении. 
А именно, i-й процессор в нагрузке тратит ai энергии за одну секунду.

Вашему серверу в качестве тестовой нагрузки придет m 
 задач. Про каждую задачу вам известны два значения: tj и lj — момент времени, когда задача j придет и время выполнения задачи в секундах.

Для начала вы решили реализовать простейший планировщик, ведущий себя следующим образом: в момент tj прихода задачи, 
вы выбираете свободный процессор с минимальным энергопотреблением и выполняете данную задачу на выбранном процессоре все заданное время. 
Если к моменту прихода задачи свободных процессоров нет, то вы просто отбрасываете задачу.

Процессор, на котором запущена задача j будет занят ровно lj секунд, то есть освободится ровно в момент tj+lj
 и в этот же момент уже может быть назначен для выполнения какой-то другой задачи.

Определите суммарное энергопотребление вашего сервера при обработке m заданных задач 
(будем считать, что процессоры в простое не потребляют энергию).

Неполные решения этой задачи (например, недостаточно эффективные) могут быть оценены частичным баллом.

Входные данные:
В первой строке заданы два целых числа n и m (1≤n,m≤3⋅105) — количество процессоров и задач соответственно.

Во второй строке заданы n целых чисел a1,a2,…,an (1≤ai≤106) — энергопотребление соответствующих процессоров под нагрузкой в секунду. 
Все энергопотребления различны.

В следующих m строках заданы описания задач: по одному в строке. В j-й строке заданы два целых числа tj
 и lj (1≤tj≤109; 1≤lj≤106) — момент прихода j-й задачи и время ее выполнения.

Все времена прихода tj различны, и задачи заданы в порядке времени прихода.

Выходные данные:
Выведите единственное число — суммарное энергопотребление сервера, если потреблением энергии в простое можно пренебречь.

Пример.
входные данные:
4 7
3 2 6 4
1 3
2 5
3 7
4 10
5 5
6 100
9 2

выходные данные:
105

Примечание
Рассмотрим работу планировщика посекундно:

t=1: приходит первая задача, все процессоры свободны. Задача занимает второй процессор на 3 секунды.
t=2: приходит вторая задача. Второй процессор занят, а потому задача занимает первый процессор на 5 секунд.
t=3: приходит третья задача и занимает четвертый процессор на 7 секунд.
t=4: приходит четвертая задача. Второй процессор освободился в данный момент, а потому его и занимает задача на 10 секунд.
t=5: приходит пятая задача и занимает последний свободный на данный момент процессор (третий) на 5 секунд.
t=6: приходит шестая задача. Все процессоры еще заняты, а потому задача отбрасывается.
t=7: освобождается первый процессор.
t=9: приходит седьмая задача и занимает первый процессор на 2 секунды.
t=10: освобождаются третий и четвертый процессоры.
t=11: освобождается первый процессор.
t=14: освобождается второй процессор.

Общее энергопотребление равно 3⋅2 + 5⋅3 + 7⋅4 + 10⋅2 + 5⋅6 + 2⋅3 = 6+15+28+20+30+6 = 105.
 */

using System.Collections.Generic;

var firstRowArr = Console.ReadLine().Split(' ').Select(it => int.Parse(it)).ToArray();

int numServers = firstRowArr[0];
int numTasks = firstRowArr[1];

long[] serverPowerArr = Console.ReadLine().Split(' ').Select(it => long.Parse(it)).ToArray();

Array.Sort(serverPowerArr);

long[][] taskList = new long[numTasks][];
List<List<long[]>> serverDict = new List<List<long[]>>();

long result = 0;

for (long i = 0; i < numTasks; i++)
{
    string[] taskStrArr = (Console.ReadLine() ?? "").Split(' ');
    taskList[i] = new long[] { long.Parse(taskStrArr[0]), long.Parse(taskStrArr[1]) };
}

for (int s = 0; s < numServers; s++)
{
    serverDict.Add(new List<long[]>());

}

foreach (long[] taskA in taskList)
{
    for (int j = 0; j < serverPowerArr.Length; j++)
    {
        var serverTaskList = serverDict[j];

        if (serverTaskList.Count == 0)
        {
            serverTaskList.Add(taskA);
            result += taskA[1] * serverPowerArr[j];
            break;
        }
        else
        {
            var taskB = serverTaskList.LastOrDefault();

            long startA = taskA[0];
            long endB = taskB[0] + taskB[1] - 1;

            if (startA > endB)
            {
                serverTaskList.Add(taskA);
                result += taskA[1] * serverPowerArr[j];
                break;
            }
        }
    }
}


Console.WriteLine(result);
